---
kind: other
id: Methods.T:Autodesk.Revit.Exceptions.AccessDeniedException
source: html/462ca41b-63cc-68c9-c56f-95c2fde3e9c5.htm
---
# AccessDeniedException Methods

Retrieves data needed to serialize the target object.